run/Tests/dropletInShearFlowSmall/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            patch;
        nFaces          10;
        startFace       180;
    }
    bottom
    {
        type            patch;
        nFaces          10;
        startFace       190;
    }
    left
    {
        type            patch;
        nFaces          10;
        startFace       200;
    }
    right
    {
        type            patch;
        nFaces          10;
        startFace       210;
    }
    frontAndBack
    {
        type            patch;
        nFaces          200;
        startFace       220;
    }
)


// ************************************************************************* //
