run/Tests/dropletInShearFlowSmall/0/fvMesh/fvU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      fvMesh/fvU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
100
(
(-0.00803115 -0 -0)
(-0.00803115 -0 -0)
(-0.00803115 -0 -0)
(-0.00803115 -0 -0)
(-0.00803115 -0 -0)
(-0.00803115 -0 -0)
(-0.00803115 -0 -0)
(-0.00803115 -0 -0)
...
)
;

boundaryField
{
    top
    {
        type            fixedValue;
        value           uniform (0.0088788825 0 0);
    }
    bottom
    {
        type            fixedValue;
        value           uniform (-0.0088788825 0 0);
    }
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
