run/Tests/dropletInShearFlowSmall/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
        minIter         2;
        maxIter         50;  
    }

    pd
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-09;
        relTol          0;
        minIter         2;
        maxIter         50;  
    }

/*    pd*/
/*    {*/
/*        solver          GAMG;*/
/*        preconditioner*/
/*        {*/
/*            preconditioner  Cholesky;*/
/*        }*/
/*        tolerance       1e-12;*/
/*        relTol          0;*/
/*        smoother        DIC;//GaussSeidel;*/
/*        nPreSweeps      2;*/
/*        nPostSweeps     4;//2*/
/*        nFinestSweeps   4;//2*/
/*        cacheAgglomeration false;*/
/*        nCellsInCoarsestLevel 10;*/
/*        agglomerator    faceAreaPair;//algebraicPair;*/
/*        mergeLevels     1;*/
/*    }*/

    pdFinal
    {
        solver          PCG;
        preconditioner  Cholesky;
        tolerance       1e-9;
        relTol          0;
    }

/*    pdFinal*/
/*    {*/
/*        solver          PCG;*/
/*        preconditioner      */
/*        {                   */

/*            preconditioner  GAMG;*/
/*            nVcycles        4;*/
/*            tolerance       1e-08;*/
/*            relTol          0;       */
/*            smoother        symGaussSeidel;//DICGaussSeidel*/
/*            //number of smoothing steps before projection*/
/*            nSmoothingSteps 2;                       */
/*            //sweeps to perform before moving to a coarser level. */
/*            nPreSweeps      1;                                    */
/*            //sweeps to perform after coarser level corrections   */
/*            nPostSweeps     1;                                    */
/*            nFinestSweeps   1;                                  */
/*            cacheAgglomeration false;                              */
/*            nCellsInCoarsestLevel 50;*/
/*            agglomerator    faceAreaPair; */
/*            //-HM alternatives: algebraicPair; faceAreaPair;                         */
/*            mergeLevels     1;                                    */
/*        }*/
/*        tolerance        1e-12;*/
/*        relTol           0;   */
/*        minIter          2;*/
/*        maxIter          50;  */
/*    }*/

    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }
    
    C 
    {
        solver          PBiCG;
        
        preconditioner  DILU;//SymGaussSeidel;
        tolerance       1e-16;
        relTol          0;

        minIter         1;
        maxIter         10;
    }

    Ccoupled    
    {
        solver           BiCGStab;
        
        preconditioner      
        {                   
            preconditioner  GaussSeidel;
            nSweeps         5;//-HM phase volume conservation!
        }

        tolerance        1e-8;
        relTol           0.001;

        minIter          0;
        maxIter          1000;
    };
}

PIMPLE
{
    momentumPredictor no;
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
    nSubCycles       2;
    pdRefCell        0;
    pRefValue        0;
    pdRefValue       0;
}

// ************************************************************************* //
